using System.Collections;
using System.Collections.Generic;
using UnityEngine;

namespace Assignment01
{
    public interface IAssignment
    {
        #region Lecture

        void LCT01_SyntaxArray();

        void LCT02_ArrayInitialize();

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍáÊ´§¼ÅÅÑ¾¸ìµÒÁ·Õè¡ÓË¹´ â´Âãªéâ¤Ã§ÊÃéÒ§¡ÒÃÇ¹«éÓ for loop
        ///
        /// for loop ·Õè 1:
        /// - ¨ÐÇ¹ÅÙ»·Ñé§ËÁ´ 10 ¤ÃÑé§ â´Â¤èÒ¢Í§ i ¨ÐàÃÔèÁµé¹·Õè 0 áÅÐà¾ÔèÁ¢Öé¹·ÕÅÐ 1 ¨¹¶Ö§¤èÒ¹éÍÂ¡ÇèÒ 10
        /// - ã¹áµèÅÐÃÍº¢Í§ÅÙ» ¨ÐáÊ´§¢éÍ¤ÇÒÁ "<![CDATA[<10 : ]]>" µÒÁ´éÇÂ¤èÒ¢Í§ i ÍÍ¡ÁÒ·Ò§ Debug.Log
        /// - ãËéãªé Debug.Log ¤Ñè¹¤èÒ
        ///
        /// ¡èÍ¹àÃÔèÁ for loop ·Õè 2 ãËé¾ÔÁ¾ì Debug.Log("======================");
        ///
        /// for loop ·Õè 2:
        /// - ¨ÐÇ¹ÅÙ»·Ñé§ËÁ´ 10 ¤ÃÑé§ â´Â¤èÒ¢Í§ i ¨ÐàÃÔèÁµé¹·Õè 1 áÅÐà¾ÔèÁ¢Öé¹·ÕÅÐ 1 ¨¹¶Ö§¤èÒà·èÒ¡Ñº 10
        /// - ã¹áµèÅÐÃÍº¢Í§ÅÙ» ¨ÐáÊ´§¢éÍ¤ÇÒÁ "<![CDATA[<=10 : ]]>" µÒÁ´éÇÂ¤èÒ¢Í§ i ÍÍ¡ÁÒ·Ò§ Debug.Log
        /// </summary>
        void LCT03_SyntaxLoop();

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍáÊ´§ÃÒÂª×èÍªØ´à¡ÃÒÐ Iron Man â´Âãªé Array áÅÐ for loop
        ///
        /// ====== Log by One incrementer ======
        /// for Loop ·Õè 1:
        /// ¤èÒ i à¾ÔèÁ¢Öé¹ ·ÕèÅÐ 1
        ///
        /// ====== Log by Two incrementer ======
        /// for Loop ·Õè 2:
        /// ¤èÒ i à¾ÔèÁ¢Öé¹ ·ÕèÅÐ 2
        ///
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì:
        ///
        /// ====== Log by One incrementer ======
        /// Mark I
        /// Mark II
        /// Mark III
        /// Mark IV
        /// Mark V
        /// Mark VI
        /// Mark VII
        /// ====== Log by Two incrementer ======
        /// Mark I
        /// Mark III
        /// Mark V
        /// Mark VII
        /// </summary>
        /// <param name="ironManSuitNames">ÍÒÃìàÃÂì¢Í§ª×èÍªØ´à¡ÃÒÐ Iron Man</param>
        void LCT04_LoopAndArray(string[] ironManSuitNames);

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁÀÒÉÒ C# à¾×èÍÊÃéÒ§ÍÒÃìàÃÂìÊÍ§ÁÔµÔ (2D array)
        /// ª×èÍ my2DArray ·ÕèÁÕ¢¹Ò´ 3 x 3 â´ÂÁÕ¤èÒàÃÔèÁµé¹´Ñ§¹Õé:
        /// { 1, 2, 3 }, { 4, 5, 6 }, { 7, 8, 9 }
        ///
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì:
        /// 1 2 3 
        /// 4 5 6 
        /// 7 8 9 
        ///
        /// 2D Array (ÍÒÃìàÃÂìÊÍ§ÁÔµÔ) ¤×ÍÍÐäÃ
        /// ÍÒÃìàÃÂìÊÍ§ÁÔµÔ ËÃ×Í 2D Array ¹Ñé¹à»ÃÕÂºàÊÁ×Í¹µÒÃÒ§·ÕèÁÕ·Ñé§á¶ÇáÅÐ¤ÍÅÑÁ¹ì â´ÂáµèÅÐªèÍ§ã¹µÒÃÒ§¹Ñé¹¨Ðà¡çº¢éÍÁÙÅä´éË¹Öè§¤èÒ ¤Ô´§èÒÂæ àËÁ×Í¹¡ÑºµÒÃÒ§ã¹ Excel àÅÂ¤ÃÑº
        ///
        /// ·ÓäÁµéÍ§ãªé 2D Array?
        /// - ¨Ñ´à¡çº¢éÍÁÙÅ·ÕèÁÕâ¤Ã§ÊÃéÒ§à»ç¹µÒÃÒ§: àËÁÒÐÊÓËÃÑº¢éÍÁÙÅ·ÕèµéÍ§¡ÒÃ¨Ñ´àÃÕÂ§à»ç¹á¶ÇáÅÐ¤ÍÅÑÁ¹ì àªè¹ µÒÃÒ§¤Ðá¹¹, µÒÃÒ§¢éÍÁÙÅÊÔ¹¤éÒ, á¼¹·Õèã¹à¡Á
        /// - à¢éÒ¶Ö§¢éÍÁÙÅä´é§èÒÂ: ÊÒÁÒÃ¶à¢éÒ¶Ö§¢éÍÁÙÅã¹µÓáË¹è§ã´æ ä´éâ´ÂµÃ§â´Âãªé´Ñª¹Õ¢Í§á¶ÇáÅÐ¤ÍÅÑÁ¹ì
        ///
        /// µÑÇÍÂèÒ§¡ÒÃ»ÃÐ¡ÒÈµÑÇá»Ã 2D Array ËÃ×ÍÍÒÃìàÃÂì 2 ÁÔµÔ
        /// Â¡µÑÇÍÂèÒ§ 2D Array (ÍÒÃìàÃÂì 2 ÁÔµÔ) ·ÕèÁÕ¡ÒÃà¡çº¤èÒ´Ñ§¹Õé
        /// 1 2 3 4 5
        /// 1 2 3 4 5
        /// 1 2 3 4 5
        ///
        /// ¨Ò¡µÑÇÍÂèÒ§ 2D Array ¹Õé ÊÒÁÒÃ¶¡ÅèÒÇä´éÇèÒ
        /// - ÁÕ¢¹Ò´ã¹ÁÔµÔ·Õè 1 à·èÒ¡Ñº 3 ËÃ×ÍàÃÒ¨ÐàÃÕÂ¡ÇèÒ array ¹ÕéÁÕ 3 á¶Ç ËÃ×Í 3 row
        /// - ÁÕ¢¹Ò´ã¹ÁÔµÔ·Õè 2 à·èÒ¡Ñº 5 ËÃ×ÍàÃÒ¨ÐàÃÕÂ¡ÇèÒ array ¹ÕéÁÕ 5 ËÅÑ¡ ËÃ×Í 5 columns
        ///
        /// ¶éÒ¨Ð»ÃÐ¡ÒÈµÑÇá»Ã 2D array ¢¹Ò´ 3 á¶Ç x 5 ËÅÑ¡ ÊÒÁÒÃ¶à¢ÕÂ¹ code ä´é´Ñ§¹Õé
        /// int[,] my2DArray = new int[3, 5];
        /// </summary>
        void LCT05_Syntax2DArray();

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁÀÒÉÒ C# à¾×èÍà¢éÒ¶Ö§¢¹Ò´¢Í§ Array ÊÍ§ÁÔµÔ (2D array)
        /// â´Â¡ÓË¹´ÁÕµÑÇá»ÃãËé´Ñ§¹Õé
        /// 
        /// int[,] my2DArray = new int[3, 5] { 
        ///     { 1, 2, 3, 4, 5 }, 
        ///     { 1, 2, 3, 4, 5 }, 
        ///     { 1, 2, 3, 4, 5 } };
        /// 
        /// àÁ×èÍà»ÃÕÂºà·ÕÂº¡Ñº 1D Array ËÃ×Í ÍÒÃìàÃÂì 1 ÁÔµÔ «Öè§àÃÒÊÒÁÒÃ¶ËÒ¢¹Ò´¢Í§ array â´Âãªé array.Length
        /// 
        /// àÁ×èÍàÃÒ·Ó§Ò¹¡Ñº 2D array àÃÒ¡çÊÒÁÒÃ¶ËÒ¢¹Ò´¢Í§ array ä´éàªè¹¡Ñ¹ à¾ÕÂ§áµèàÃÒ¨ÐµéÍ§ÃÐºØÇèÒµéÍ§¡ÒÃ¢¹Ò´¢Í§ÁÔµÔã´â´Âãªé
        /// 
        /// function array.GetLength(0) à¾×èÍËÒ¢¹Ò´¢Í§ÁÔµÔ·Õè 1 ËÃ×Í¨Ó¹Ç¹á¶Ç (row)
        /// áÅÐ function array.GetLength(1) à¾×èÍËÒ¢¹Ò´¢Í§ÁÔµÔ·Õè 2 ËÃ×Í¨Ó¹Ç¹ËÅÑ¡ (col)
        /// 
        /// àÊÃç¨áÅéÇãËé Log ÍÍ¡ÁÒ´Ñ§¹Õé
        /// Debug.Log($"rows = {rows}");
        /// Debug.Log($"cols = {cols}");
        /// </summary>
        void LCT06_SizeOf2DArray(int[,] my2DArray);

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁÀÒÉÒ C# à¾×èÍáÊ´§¼ÅÅÑ¾¸ì´Ñ§ÀÒ¾µèÍä»¹Õé â´Âãªé Nested loop
        /// â´Â¡ÓË¹´ãËé ÁÕµÑÇá»Ã´Ñ§¹Õé
        /// 
        /// public int columns = 3;
        /// public int rows = 4;
        /// 
        /// µÑÇÍÂèÒ§Ë¹éÒµÒ¢Í§ Nested Loop
        /// for (int i = 0; i < 4; i++)
        /// {
        ///     for (int j = 0; j < 3; j++)
        ///     {
        ///        
        ///     }
        /// }
        /// 
        /// µÑÇÍÂèÒ§¡ÒÃ run program:
        /// 
        /// Case 1
        /// Column ...
        /// 3
        /// Row ...
        /// 4
        /// ***
        /// ***
        /// ***
        /// ***
        /// 
        /// Case 2
        /// Column ...
        /// 10
        /// Row ...
        /// 1
        /// **********
        /// 
        /// Case 3
        /// Column ...
        /// 10
        /// Row ...
        /// 10
        /// **********
        /// **********
        /// **********
        /// **********
        /// **********
        /// **********
        /// **********
        /// **********
        /// **********
        /// **********
        /// 
        /// Nested Loop ËÃ×Í ÅÙ»«éÍ¹ ¤×Í ¡ÒÃ¹ÓÅÙ»Ë¹Öè§ÁÒ«éÍ¹ÍÂÙèÀÒÂã¹ÍÕ¡Ë¹Öè§ÅÙ» ·ÓãËéà¡Ô´¡ÒÃÇ¹«éÓ«éÍ¹¡Ñ¹ËÅÒÂªÑé¹ ÅÍ§¹Ö¡ÀÒ¾àËÁ×Í¹¡ÅèÍ§ãÊè¡ÅèÍ§ÍÕ¡·ÕË¹Öè§ «Öè§¡ÅèÍ§ªÑé¹ã¹¨ÐÇ¹«éÓËÅÒÂÃÍº¡èÍ¹·Õè¡ÅèÍ§ªÑé¹¹Í¡¨Ðà»ÅÕèÂ¹ä»Ë¹Öè§ÃÍº
        /// 
        /// ·ÓäÁµéÍ§ãªé Nested Loop?
        /// - ¨Ñ´¡ÒÃ¢éÍÁÙÅËÅÒÂÁÔµÔ: àËÁÒÐÊÓËÃÑº¢éÍÁÙÅ·Õè¨Ñ´àÃÕÂ§à»ç¹µÒÃÒ§ ËÃ×ÍÁÕâ¤Ã§ÊÃéÒ§·Õè«Ñº«éÍ¹ àªè¹ ÍÒÃìàÃÂìÊÍ§ÁÔµÔ
        /// - ÊÃéÒ§ÃÙ»áºº·Õè«éÓ«éÍ¹: ãªéÊÃéÒ§ÃÙ»áººµèÒ§æ àªè¹ µÒÃÒ§ÊÙµÃ¤Ù³, ÃÙ»·Ã§àÃ¢Ò¤³Ôµ
        /// - á¡é»Ñ­ËÒ·Õè«Ñº«éÍ¹: ÊÒÁÒÃ¶¹Óä»ãªéá¡é»Ñ­ËÒ·ÕèµéÍ§·Ó¡ÒÃÇ¹«éÓËÅÒÂªÑé¹
        /// 
        /// µÑÇÍÂèÒ§:
        /// ÊÁÁµÔÇèÒàÃÒµéÍ§¡ÒÃ¾ÔÁ¾ìµÒÃÒ§ÊÙµÃ¤Ù³µÑé§áµè 1 ¤Ù³ 1 ¶Ö§ 5 ¤Ù³ 5 àÃÒÊÒÁÒÃ¶ãªé Nested Loop ä´é´Ñ§¹Õé:
        /// 
        /// for (int i = 1; i <= 5; i++) // ÅÙ»ËÅÑ¡ (Ç¹«éÓá¶Ç)
        /// {
        ///     for (int j = 1; j <= 5; j++) // ÅÙ»«éÍ¹ (Ç¹«éÓ¤ÍÅÑÁ¹ì)
        ///     {
        ///         Console.Write(i * j + " ");
        ///     }
        ///     Console.WriteLine();
        /// }
        /// </summary>
        void LCT07_SyntaxNestedLoop(int columns, int rows);

        #endregion

        #region Assignment

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍÊØèÁ¡ÒÃ´ÃÍ»äÍà·çÁ
        /// ¨Ò¡ÃÒÂ¡ÒÃ¢Í§äÍà·çÁ (GameObject[] items) ·Õè¡ÓË¹´ãËé áÅÐÊÃéÒ§ÇÑµ¶Ø (Instantiate) ¨Ò¡ÃÒÂ¡ÒÃ·Õè¶Ù¡àÅ×Í¡ÊØèÁ¹Ñé¹
        /// áÅÐ¾ÔÁ¾ìª×èÍÍÍ¡ÁÒ·Ò§¤Í¹â«Å (field name)
        /// µÑÇÍÂèÒ§àªè¹
        /// Debug.Log($"Got item: {go.name}");
        /// </summary>
        void AS01_RandomItemDrop(GameObject[] items);

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁã¹ Unity C# à¾×èÍÊÃéÒ§á¼¹·Õè 2D â´Âãªé Nested Loop
        /// ¡ÓË¹´¢¹Ò´: ¡ÓË¹´¨Ó¹Ç¹¤ÍÅÑÁ¹ì (columns) áÅÐ¨Ó¹Ç¹á¶Ç (rows) ¢Í§¾×é¹·ÕèàÅè¹
        /// â´Â¡ÓË¹´ãËé ÁÕµÑÇá»Ã´Ñ§¹Õé
        /// public int columns = 5;
        /// public int rows = 5;
        /// 
        /// ÊÃéÒ§ÇÑµ¶ØáººÊØèÁ: àÅ×Í¡ÇÑµ¶Ø¾×é¹ (floorTiles) ¨Ò¡ÍÒÃìàÃÂìáººÊØèÁã¹áµèÅÐµÓáË¹è§ â´Â¡ÓË¹´ãËé ÁÕµÑÇá»Ã´Ñ§¹Õé
        /// public GameObject[] floorTiles;
        /// 
        /// â´Â·ÕèàÁ×èÍ program run ÃÐºº¨Ð¡ÓË¹´¤èÒã¹ array ÁÒãËé 3 GameObject â´ÂáµèÅÐ GameObject ÁÕª×èÍ´Ñ§¹Õé
        /// 1 á·¹¾×é¹áºº·Õè 1
        /// 2 á·¹¾×é¹áºº·Õè 2
        /// 0 á·¹¾×é¹¸ÃÃÁ´Ò
        /// 
        /// ÇÒ§ÇÑµ¶Ø: ÇÒ§ÇÑµ¶Ø·ÕèàÅ×Í¡äÇéã¹µÓáË¹è§·Õè¡ÓË¹´ â´Âãªé¿Ñ§¡ìªÑ¹ Instantiate áÅÐ¡ÓË¹´µÓáË¹è§¼èÒ¹ index ¢Í§ X Y Å§ã¹ Vector2
        /// GameObject tile = Instantiate(obj, new Vector2(x, y), transform.rotation);
        /// 
        /// áÅÐãËé¾ÔÁ¾ìª×èÍ¢Í§ GameObject tile ÍÍ¡ÁÒà¾×èÍáÊ´§ pattern ¢Í§ map ·Õè random ÊØèÁ¾×é¹ÍÍ¡ÁÒä´é ´éÇÂ code
        /// Console.Write(tile.name);
        /// 
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì:
        /// 
        /// Case 1: ÊÃéÒ§ map ¢¹Ò´ 3x3 áÅÐÊØèÁ¾×é¹ä´éà»ç¹ pattern
        /// Column ...
        /// 3
        /// Row ...
        /// 3
        /// 211
        /// 110
        /// 000
        /// 
        /// Case 2: ÊÃéÒ§ map ¢¹Ò´ 10x10 áÅÐÊØèÁ¾×é¹ä´éà»ç¹ pattern
        /// Column ...
        /// 10
        /// Row ...
        /// 10
        /// 0100221122
        /// 2011120022
        /// 0210021000
        /// 2010112011
        /// 2001101221
        /// 0002200210
        /// 1221002122
        /// 2001102001
        /// 2200122110
        /// 1101112120
        /// </summary>
        void AS02_NestedLoopForCreate2DMap(GameObject[] floorTiles, int columns, int rows);

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁã¹ Unity C# à¾×èÍÊÃéÒ§¡Óá¾§ÃÍº¹Í¡ â´Âãªé Nested Loop
        /// ¡ÓË¹´¢¹Ò´: ¡ÓË¹´¨Ó¹Ç¹¤ÍÅÑÁ¹ì (columns) áÅÐ¨Ó¹Ç¹á¶Ç (rows) ¢Í§¾×é¹·ÕèàÅè¹
        /// â´Â¡ÓË¹´ãËéÁÕµÑÇá»Ã´Ñ§¹Õé
        /// 
        /// public int columns = 5;
        /// public int rows = 5;
        /// 
        /// ÊÃéÒ§ÇÑµ¶Ø¡Óá¾§: (Wall) ã¹µÑÇá»Ã GameObject
        /// â´Â¡ÓË¹´ãËéÁÕµÑÇá»Ã´Ñ§¹Õé
        /// 
        /// public GameObject wall;
        /// 
        /// «Öè§àÁ×èÍâ»Ãá¡ÃÁàÃÔèÁ ÃÐºº¨Ð¡ÓË¹´ãËé GameObject wall ÁÕª×èÍ "*"
        /// 
        /// ÇÒ§¡Óá¾§: äÇéã¹µÓáË¹è§ X -1 : Y -1 áÅÐ columns +1 : rows +1 â´Âãªé¿Ñ§¡ìªÑ¹ Instantiate áÅÐ¡ÓË¹´µÓáË¹è§¼èÒ¹ index ¢Í§ X Y Å§ã¹ Vector2
        /// if (x == 0 || x == columns - 1 || y == 0 || y == rows - 1) {
        ///     Instantiate(wall, new Vector2(x, y), transform.rotation);
        /// }
        /// 
        /// «Öè§¨Ò¡à§×èÍ¹ä¢´Ñ§¡ÅèÒÇ Pattern áÅÐà§×èÍ¹ä¢¢Í§¡ÒÃÇÒ§µÓáË¹è§¡Óá¾§¨ÐÁÕ 4 ÃÙ»áºº ¡ÓË¹´ãËé x á·¹ index ¢Í§ Column áÅÐ y á·¹ index ¢Í§ Row
        /// - äÇéã¹µÓáË¹è§¢Íºº¹ÊØ´ ËÃ×Í Row áÃ¡ => y == 0
        /// - äÇéã¹µÓáË¹è§¢ÍºÅèÒ§ÊØ´ ËÃ×Í row ÊØ´·éÒÂ => y == rows - 1
        /// - äÇéã¹µÓáË¹è§¢Íº«éÒÂÊØ´ ËÃ×Í Column áÃ¡ => x == 0
        /// - äÇéã¹µÓáË¹è§¢ÇÒÊØ´ ËÃ×Í Column ÊØ´·éÒÂ => x == columns - 1
        /// 
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì:
        /// 
        /// Case 1
        /// Column ...
        /// 5
        /// Row ...
        /// 3
        /// *******
        /// *     *
        /// *     *
        /// *     *
        /// *******
        /// 
        /// Case 2
        /// Column ...
        /// 3
        /// Row ...
        /// 5
        /// *****
        /// *   *
        /// *   *
        /// *   *
        /// *   *
        /// *   *
        /// *****
        /// 
        /// Case 3
        /// Column ...
        /// 10
        /// Row ...
        /// 4
        /// ************
        /// *          *
        /// *          *
        /// *          *
        /// *          *
        /// ************
        /// 
        /// Case 4 - ¡Ã³Õ¾ÔàÈÉ¡Óá¾§ÇÒ§ÅéÍÁáººäÁèÁÕªèÍ§ÇèÒ§µÃ§¡ÅÒ§àÅÂ
        /// Column ...
        /// 2
        /// Row ...
        /// 2
        /// ****
        /// *  *
        /// *  *
        /// ****
        /// 
        /// µÃÇ¨ÊÍº¢Íº:
        /// if (x == 0 || x == columns - 1 || y == 0 || y == rows - 1) à»ç¹à§×èÍ¹ä¢·ÕèµÃÇ¨ÊÍºÇèÒµÓáË¹è§»Ñ¨¨ØºÑ¹ (x, y) ÍÂÙè·Õè¢Íº¢Í§¾×é¹·ÕèËÃ×ÍäÁè
        /// columns áÅÐ rows à»ç¹µÑÇá»Ã·Õè¡ÓË¹´¢¹Ò´¢Í§¾×é¹·ÕèàÅè¹
        /// x == 0 ËÃ×Í x == columns - 1 µÃÇ¨ÊÍºÇèÒµÓáË¹è§ÍÂÙè·Õè¢Íº«éÒÂËÃ×Í¢ÇÒ
        /// y == 0 ËÃ×Í y == rows - 1 µÃÇ¨ÊÍºÇèÒµÓáË¹è§ÍÂÙè·Õè¢Íºº¹ËÃ×ÍÅèÒ§
        /// </summary>
        void AS03_NestedLoopForMakingWallAround(GameObject wall, int columns, int rows);

        /// <summary>
        /// ãËé¹Ñ¡ÈÖ¡ÉÒà¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍâ¨ÁµÕà»éÒËÁÒÂ´Ñ§¹Õé
        /// µÑÇá»Ã·Õèà¡ÕèÂÇ¢éÍ§
        /// public int[] enemyHP; array ·Õèà¡çº hp ¢Í§ enemy
        /// public int damage; ¨Ó¹Ç¹ damage ·Õè user ÃÐºØ 
        /// public int target; target index ¢Í§ enemy
        /// 
        /// ÃÙ»áºº·Õè 1 â¨ÁµÕµÑÇáÃ¡ã¹ÃÒÂ¡ÒÃ
        /// àÁ×èÍ¼ÙéãªéãÊ input Damage à¢éÒÁÒ ¨Ðâ¨ÁµÕµÑÇáÃ¡àÊÁÍ áÅéÇãËé¾ÔÁ¾ì FirstEnemy hp :<hp ·ÕèàËÅ×Í> 
        /// ÃÙ»áºº·Õè 2 â¨ÁµÕµÑÇÊØ´·éÒÂã¹ÃÒÂ¡ÒÃ
        /// àÁ×èÍ¼ÙéãªéãÊ input Damage à¢éÒÁÒ ¨Ðâ¨ÁµÕµÑÇÊØ´·éÒÂàÊÁÍ  áÅéÇãËé¾ÔÁ¾ì LastEnemy hp :<hp ·ÕèàËÅ×Í> 
        /// ÃÙ»áºº·Õè 3 â¨ÁµÕµÑÇà»éÒËÁÒÂ·Õè¡ÓË¹´
        /// àÁ×èÍ¼ÙéãªéãÊè input Damage à¢éÒÁÒ áÅÐ input àÅ×Í¡à»éÒËÁÒÂ·Õè¨Ðâ¨ÁµÕ´éÇÂ index ¢Í§ array ¨Ò¡¹Ñé¹·Ó¡ÒÃâ¨ÁµÕà»éÒËÁÒÂ·ÕèµéÍ§¡ÒÃ  áÅéÇãËé¾ÔÁ¾ì TargetEnemy <target> hp :<hp ·ÕèàËÅ×Í> 
        /// 
        /// â´Â·Õè Program ¨Ð·Ó¡ÒÃ Attack àÃÕÂ§¨Ò¡ÃÙ»áºº·Õè 1, 2 áÅÐ 3 µÒÁÅÓ´Ñº
        /// 
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì
        /// FirstEnemy hp :8
        /// LastEnemy hp :8
        /// TargetEnemy 3 hp :8
        /// </summary>
        /// <param name="enemyHP">array ·Õèà¡çº hp ¢Í§ enemy</param>
        /// <param name="damage"></param>
        /// <param name="target"></param>
        void AS04_AttackEnemy(int[] enemyHP, int damage, int target);

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍÊÃéÒ§ for ÅÙ» ¨Ò¡ 0 - (n-1)
        /// â´Â¡ÓË¹´ãËé n ÃÑº¤èÒ¨Ò¡¼Ùéãªé
        /// ãËé n ÃÑº¤èÒ¨Ó¹Ç¹àµçÁ¨Ò¡ªèÍ§»éÍ¹¢éÍÁÙÅ inputField
        /// ÊÃéÒ§ÅÙ»«éÓ ·Õè¨ÐÇ¹«éÓ¨Ó¹Ç¹¤ÃÑé§·Õè¼Ùéãªé¡ÓË¹´ã¹¤èÒ n
        /// áÊ´§¼ÅÅÑ¾¸ìà»ç¹µÑÇàÅ¢·Õèà¾ÔèÁ¢Öé¹·ÕÅÐ 1 àÃÔèÁ¨Ò¡ 0 ¨¹¶Ö§¤èÒ n-1
        /// µÑÇÍÂèÒ§: ¶éÒ¼Ùéãªé»éÍ¹¤èÒ 5 Å§ã¹ inputField ¼ÅÅÑ¾¸ì·Õèä´é¨ÐáÊ´§ã¹ Debug Log ´Ñ§¹Õé:
        /// 0
        /// 1
        /// 2
        /// 3
        /// 4
        /// </summary>
        /// <param name="n">¤èÒ¨Ó¹Ç¹àµçÁ·ÕèÃÑº¨Ò¡ inputField</param>
        void AS05_DynamicIterationLoop(int n);

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍáÊ´§ÃÒÂª×èÍªØ´à¡ÃÒÐ Iron Man â´Âãªé Array áÅÐ while loop
        /// ãËéÃÑºÍÒÃìàÃÂì¢Í§ÊµÃÔ§·Õèà¡çºª×èÍªØ´à¡ÃÒÐ àªè¹:
        /// [
        ///     "Mark I",
        ///     "Mark II",
        ///     "Mark III",
        ///     "Mark IV",
        ///     "Mark V",
        ///     "Mark VI",
        ///     "Mark VII"
        /// ]
        ///
        /// ·ÓÊÍ§ÃÙ»áººâ´Âãªé while loop:
        /// ======Log by One======
        /// while Loop ·Õè 1:
        /// - ãËéµÑÇ¹Ñº i àÃÔèÁ·Õè 0 áÅÐà¾ÔèÁ¤ÃÑé§ÅÐ 1 (i += 1)
        /// - ¾ÔÁ¾ì¤èÒ¨Ò¡ÍÒÃìàÃÂìµÒÁÅÓ´Ñº index 0, 1, 2, 3, ...
        ///
        /// ======Log by Two======
        /// while Loop ·Õè 2:
        /// - ãËéµÑÇ¹Ñº i àÃÔèÁ·Õè 0 áÅÐà¾ÔèÁ¤ÃÑé§ÅÐ 2 (i += 2)
        /// - ¾ÔÁ¾ì¤èÒ¨Ò¡ÍÒÃìàÃÂìµÒÁ index 0, 2, 4, 6, ...
        ///
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì:
        /// ======Log by One======
        /// Mark I
        /// Mark II
        /// Mark III
        /// Mark IV
        /// Mark V
        /// Mark VI
        /// Mark VII
        /// ======Log by Two======
        /// Mark I
        /// Mark III
        /// Mark V
        /// Mark VII
        /// </summary>
        void AS06_WhileLoopAndArray(string[] ironManSuitNames);

        /// <summary>
        /// ãËé¹Ñ¡ÈÖ¡ÉÒà¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍ Heal à»éÒËÁÒÂ´Ñ§¹Õé
        /// µÑÇá»Ã·Õèà¡ÕèÂÇ¢éÍ§
        /// 
        /// public int[] heroHPs; // array ·Õèà¡çº hp ¢Í§ hero
        /// public int heal; // ¨Ó¹Ç¹ heal ·Õè user ÃÐºØ
        /// public int targetIndex; // target index ¢Í§ hero
        /// 
        /// ÃÙ»áºº·Õè 1 Heal µÑÇáÃ¡ã¹ÃÒÂ¡ÒÃ
        /// àÁ×èÍ¼ÙéãªéãÊè input Heal à¢éÒÁÒ ¨Ð Heal µÑÇáÃ¡àÊÁÍ áÅéÇãËé¾ÔÁ¾ì FirstHero hp :<hp ËÅÑ§¨Ò¡ heal áÅéÇ>
        /// 
        /// ÃÙ»áºº·Õè 2 Heal µÑÇÊØ´·éÒÂã¹ÃÒÂ¡ÒÃ
        /// àÁ×èÍ¼ÙéãªéãÊè input Heal à¢éÒÁÒ ¨Ð Heal µÑÇÊØ´·éÒÂàÊÁÍ áÅéÇãËé¾ÔÁ¾ì LastHero hp :<hp ËÅÑ§¨Ò¡ heal áÅéÇ>
        /// 
        /// ÃÙ»áºº·Õè 3 Heal µÑÇà»éÒËÁÒÂ·Õè¡ÓË¹´
        /// àÁ×èÍ¼ÙéãªéãÊè input Heal à¢éÒÁÒ áÅÐ input àÅ×Í¡à»éÒËÁÒÂ·Õè¨Ð heal ´éÇÂ index ¢Í§ array ¨Ò¡¹Ñé¹·Ó¡ÒÃ heal à»éÒËÁÒÂ·ÕèµéÍ§¡ÒÃ áÅéÇãËé¾ÔÁ¾ì TargetHero <targetIndex> hp :<hp ËÅÑ§¨Ò¡ Heal áÅéÇ>
        /// 
        /// â´Â·Õè Program ¨Ð·Ó¡ÒÃ Heal àÃÕÂ§¨Ò¡ÃÙ»áºº·Õè 1, 2 áÅÐ 3 µÒÁÅÓ´Ñº
        /// 
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì
        /// FirstHero hp :8
        /// LastHero hp :8
        /// TargetHero 3 hp :8
        /// </summary>
        /// <param name="heroHPs">array ·Õèà¡çº hp ¢Í§ hero</param>
        /// <param name="heal">¨Ó¹Ç¹ heal ·Õè user ÃÐºØ</param>
        /// <param name="targetIndex">target index ¢Í§ hero</param>
        void AS07_HealTargetAtIndex(int[] heroHPs, int heal, int targetIndex);

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍÊÃéÒ§ÃÐººº·Ê¹·¹Ò·ÕèáÊ´§¢éÍ¤ÇÒÁáººÊØèÁ¨Ò¡ªØ´¢éÍ¤ÇÒÁ·Õè¡ÓË¹´äÇé
        /// â´Â¡ÓË¹´ãËé
        /// µÑÇá»Ã:
        /// dialogues: à»ç¹ Array ·Õèà¡çºªØ´¢éÍ¤ÇÒÁº·Ê¹·¹Ò·Ñé§ËÁ´
        /// r: à»ç¹µÑÇá»Ãª¹Ô´ int ãªéÊÓËÃÑºà¡çº¤èÒÊØèÁà¾×èÍàÅ×Í¡¢éÍ¤ÇÒÁ
        /// áÅÐáÊ´§¼Å¢éÍ¤ÇÒÁÍÍ¡ÁÒ·Ò§Ë¹éÒ¨Í
        /// µÑÇÍÂèÒ§ ¡ÒÃãªé function Random
        /// int r = UnityEngine.Random.Range(0, dialogues.Length);
        /// ÊÑ§à¡µÇèÒ¨ÐµéÍ§ãÊè UnityEngine.Random á·¹·Õè¨Ðãªé Random ä´éàÅÂ à¹×èÍ§¨Ò¡ÇèÒºÒ§¤ÃÑé§ã¹ code ÁÕ¡ÒÃ»ÃÐ¡ÒÈ using System; áÅÐ using UnityEngine; äÇé·Ñé§¤Ùè «Öè§·Ñé§ 2 namespace ¨ÐÁÕ class Random ÍÂÙè´éÇÂ¡Ñ¹·Ñé§¤Ùè ·ÓãËé compile ÊÑºÊ¹ÇèÒ¨Ðãªé Random ¨Ò¡ namespace ã´ ¡ÒÃÃÐºØä»áººá¹èªÑ´àÅÂÇèÒà»ç¹ Random ¨Ò¡ UnityEngine â´Âãªé UnityEngine.Random à¾×èÍËÅÕ¡àÅÕèÂ§»Ñ­ËÒ¹Õé
        /// 
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì
        /// 
        /// ¾Ù´¤ØÂ¡Ñº NPC
        /// 
        /// ¤Ø³à»ç¹ÍÂèÒ§äÃºéÒ§¤ÃÑº
        /// </summary>
        /// <param name="dialogues">Array ·Õèà¡çºªØ´¢éÍ¤ÇÒÁº·Ê¹·¹Ò·Ñé§ËÁ´</param>
        void AS08_RandomPickingDialogue(string[] dialogues);

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍÊÃéÒ§µÒÃÒ§ÊÙµÃ¤Ù³ ¨Ò¡ 1 - 12
        /// â´ÂãËé¼Ùéãªé»éÍ¹¨Ó¹Ç¹¹Ñé¹à¢éÒÁÒã¹ªèÍ§ inputField áÅÐáÊ´§¼ÅÅÑ¾¸ìÍÍ¡ÁÒã¹ÃÙ»áºº¢Í§ÊÙµÃ¤Ù³ àªè¹ "5x1=5", "5x2=10", ...
        /// â´ÂäÅè¨Ò¡ 1 - 12
        /// áÅÐ Log ¤èÒÍÍ¡ÁÒ´Ñ§¹Õé
        /// 5x1=5
        /// 5x2=10
        /// 5x3=15
        /// 5x4=20
        /// 5x5=25
        /// 5x6=30
        /// 5x7=35
        /// 5x8=40
        /// 5x9=45
        /// 5x10=50
        /// </summary>
        /// <param name="n">¨Ó¹Ç¹·ÕèµéÍ§¡ÒÃÊÃéÒ§µÒÃÒ§ÊÙµÃ¤Ù³</param>
        void AS09_MultiplicationTable(int n);

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍËÒ¼ÅÃÇÁ¢Í§¨Ó¹Ç¹àµçÁµÑé§áµè 1 ¶Ö§¨Ó¹Ç¹·Õè¼Ùéãªé»éÍ¹ â´Âãªé while loop
        /// ¡ÓË¹´µÑÇá»Ã:
        /// sum: ãªéà¡çº¼ÅÃÇÁ¢Í§¨Ó¹Ç¹àµçÁ
        /// i: ãªéà»ç¹µÑÇ¹Ñºã¹¡ÒÃÇ¹ÅÙ»
        /// n: à¡çº¤èÒ¨Ó¹Ç¹àµçÁ·Õè¼Ùéãªé»éÍ¹à¢éÒÁÒ
        /// Ç¹ÅÙ»:
        /// à§×èÍ¹ä¢: Ç¹ÅÙ»¨Ð·Ó§Ò¹µèÍä»µÃÒºã´·Õè¤èÒ¢Í§ i ¹éÍÂ¡ÇèÒËÃ×Íà·èÒ¡Ñº n
        /// ºÇ¡ÊÐÊÁ: ã¹áµèÅÐÃÍº¢Í§ÅÙ» ¤èÒ¢Í§ i ¨Ð¶Ù¡ºÇ¡à¢éÒä»ã¹ sum ·ÓãËé sum à¡çº¼ÅÃÇÁ¢Í§¨Ó¹Ç¹àµçÁ·Ñé§ËÁ´·ÕèÇ¹ÅÙ»ÁÒáÅéÇ
        /// à¾ÔèÁ¤èÒµÑÇ¹Ñº: ¤èÒ¢Í§ i ¨Ð¶Ù¡à¾ÔèÁ¢Öé¹ 1 à¾×èÍàµÃÕÂÁÊÓËÃÑº¡ÒÃÇ¹ÅÙ»ÃÍº¶Ñ´ä»
        /// àÁ×èÍ¼ÙéãªéãÊèàÅ¢ 5
        ///
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì:
        ///
        /// ¼ÅÃÇÁ¢Í§ n ¨Ò¡ 1 ¶Ö§ 5 ¤×Í 15
        /// </summary>
        /// <param name="n">¨Ó¹Ç¹àµçÁ·Õè¼Ùéãªé»éÍ¹à¢éÒÁÒ</param>
        void AS10_FindSummationFromZeroToNUsingWhileLoop(int n);

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍÊÃéÒ§ÈÑµÃÙËÅÒÂµÑÇµÒÁ¨Ó¹Ç¹áÅÐµÓáË¹è§·Õè¡ÓË¹´ â´ÂÁÕà§×èÍ¹ä¢´Ñ§¹Õé:
        /// 
        /// ÊÃéÒ§µÑÇá»Ã: ÊÃéÒ§µÑÇá»Ã Enemy ·Õèà»ç¹ª¹Ô´ GameObject à¾×èÍà¡çº¢éÍÁÙÅ¢Í§ÈÑµÃÙ·Õè¨ÐÊÃéÒ§ áÅÐÊÃéÒ§µÑÇá»Ã HpEnemy ·Õèà»ç¹ª¹Ô´ int[] à¾×èÍà¡çº¤èÒ HP ¢Í§ÈÑµÃÙáµèÅÐµÑÇ
        /// Ç¹ÅÙ»ÊÃéÒ§ÈÑµÃÙ:
        /// ãªé for loop à¾×èÍÇ¹ÅÙ»ÊÃéÒ§ÈÑµÃÙµÒÁ¨Ó¹Ç¹·Õè¡ÓË¹´ã¹ÍÒÃìàÃÂì HpEnemy
        /// ã¹áµèÅÐÃÍº¢Í§ÅÙ» ãËéÊÃéÒ§ÈÑµÃÙË¹Öè§µÑÇâ´Âãªé Instantiate â´Â¡ÓË¹´µÓáË¹è§¢Í§ÈÑµÃÙãËéËèÒ§¨Ò¡µÓáË¹è§»Ñ¨¨ØºÑ¹¢Í§ÇÑµ¶Ø·ÕèµÔ´ script ¹Õéä»µÒÁá¡¹ X à»ç¹ÃÐÂÐ·Ò§·Õèà¾ÔèÁ¢Öé¹·ÕÅÐ 1 Ë¹èÇÂã¹áµèÅÐÃÍº
        /// ¡ÓË¹´ãËéÃÍº·Õè 1 ËÃ×Í i == 0 ãËé enemy ÍÂÙèã¹µÓáË¹è§·Õè x = 1
        /// áÅÐÃÍº·Õè 2 ËÃ×Í i == 1 ãËé enemy ÍÂÙèã¹µÓáË¹è§·Õè x = 2
        /// áÅÐÃÍº·Õè 3 ËÃ×Í i == 2 ãËé enemy ÍÂÙèã¹µÓáË¹è§·Õè x = 3
        /// ...
        /// áÅÐÃÍº·Õè n ËÃ×Í i == n-1 ãËé enemy ÍÂÙèã¹µÓáË¹è§·Õè x = n
        /// áÊ´§¼Å: àÁ×èÍÃÑ¹â»Ãá¡ÃÁ ¨ÐµéÍ§àËç¹ÈÑµÃÙËÅÒÂµÑÇ¶Ù¡ÊÃéÒ§¢Öé¹ÁÒàÃÕÂ§¡Ñ¹µÒÁµÓáË¹è§·Õè¡ÓË¹´
        /// </summary>
        /// <param name="enemyHPs">ÍÒÃìàÃÂì¢Í§ HP ÈÑµÃÙáµèÅÐµÑÇ</param>
        /// <param name="enemyPrefab">Prefab ¢Í§ÈÑµÃÙ</param>
        void AS11_SpawnEnemies(int[] enemyHPs, GameObject enemyPrefab);

        /// <summary>
        /// </summary>
        IEnumerator AS12_CountTime(float CountTime);

        /// <summary>
        /// ãËé¹Ñ¡ÈÖ¡ÉÒà¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍËÒ¼ÅÃÇÁ¢Í§µÑÇàÅ¢ã¹ Row (á¶Ç)
        /// 
        /// https://cdn-api.elice.io/api-attachment/attachment/8a7f0bbcdbd54117bef5a8742d99496c/image.png
        /// 
        /// â´Â¡ÓË¹´ãËé ÁÕµÑÇá»Ã´Ñ§¹Õé
        /// 
        /// public int[,] matrix = {
        ///     { 1, 2, 3 }, 
        ///     { 4, 5, 6 }, 
        ///     { 7, 8, 9 } };
        /// 
        /// â´ÂãËéãªé for à¾×èÍËÒ¼ÅÃÇÁ¢Í§µÑÇàÅ¢ã¹ Row ·ÕèÃÐºØâ´ÂµÑÇá»Ã public int row;
        /// áÅÐà¢éÒ¶Ö§¢¹Ò´¢Í§ column â´Âãªé¤ÓÊÑè§ matrix.GetLength(1)
        /// 
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì:
        /// 
        /// Case 1 - ¼ÅÃÇÁ¢Í§ Row #0 = 1 + 2 + 3
        /// Row ...
        /// 0
        /// 6
        /// 
        /// Case 2 - ¼ÅÃÇÁ¢Í§ Row #1 = 4 + 5 + 6
        /// Row ...
        /// 1
        /// 15
        /// 
        /// Case 3 - ¼ÅÃÇÁ¢Í§ Row #2 = 7 + 8 + 9
        /// Row ...
        /// 2
        /// 24
        /// 
        /// ¡ÒÃà¢éÒ¶Ö§¢¹Ò´¢Í§ 2D Array
        /// matrix.GetLength(1): ãªéà¾×èÍËÒ¨Ó¹Ç¹¤ÍÅÑÁ¹ìã¹ÍÒÃìàÃÂì matrix â´Â·Õè 1 ËÁÒÂ¶Ö§ÁÔµÔ·ÕèÊÍ§ (¤ÍÅÑÁ¹ì)
        /// matrix.GetLength(0): ãªéà¾×èÍËÒ¨Ó¹Ç¹á¶Çã¹ÍÒÃìàÃÂì matrix â´Â·Õè 0 ËÁÒÂ¶Ö§ÁÔµÔáÃ¡ (á¶Ç)
        /// </summary>
        /// <param name="matrix">2D array ·Õèà¡çºµÑÇàÅ¢</param>
        /// <param name="row">á¶Ç·ÕèµéÍ§¡ÒÃËÒ¼ÅÃÇÁ</param>
        void AS13_SumOfNumbersInRow(int[,] matrix, int row);
        /// <summary>
        /// ãËé¹Ñ¡ÈÖ¡ÉÒà¢ÕÂ¹â»Ãá¡ÃÁà¾×èÍËÒ¼ÅÃÇÁ¢Í§¤ÍÅÑÁ¹ì
        /// 
        /// https://cdn-api.elice.io/api-attachment/attachment/1f5f0b4e6ee64c4f8040b43685c8a6f5/image.png
        /// 
        /// â´Â¡ÓË¹´ãËé ÁÕµÑÇá»Ã´Ñ§¹Õé
        /// 
        /// public int[,] matrix = {
        ///     { 1, 2, 3 }, 
        ///     { 4, 5, 6 }, 
        ///     { 7, 8, 9 } };
        /// 
        /// â´ÂãËéãªé for à¾×èÍÃÇÁ¼ÅÅÑ¾¸ìáÅÐà¢éÒ¶Ö§¢¹Ò´¢Í§á¶Çâ´Âãªé¤ÓÊÑè§ matrix.GetLength(0)
        /// 
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì:
        /// 
        /// Case 1: ¼ÅÃÇÁ¢Í§µÑÇàÅ¢ã¹ Column #0 = 1 + 4 + 7 = 12
        /// Col ...
        /// 0
        /// 12
        /// 
        /// Case 2: ¼ÅÃÇÁ¢Í§µÑÇàÅ¢ã¹ Column #1 = 2 + 5 + 8 = 15
        /// Col ...
        /// 1
        /// 15
        /// 
        /// Case 3: ¼ÅÃÇÁ¢Í§µÑÇàÅ¢ã¹ Column #2 = 3 + 6 + 9 = 18
        /// Col ...
        /// 2
        /// 18
        /// 
        /// ¡ÒÃà¢éÒ¶Ö§¢¹Ò´¢Í§ 2D Array
        /// myArray.GetLength(1): ãªéà¾×èÍËÒ¨Ó¹Ç¹¤ÍÅÑÁ¹ìã¹ÍÒÃìàÃÂì myArray â´Â·Õè 1 ËÁÒÂ¶Ö§ÁÔµÔ·ÕèÊÍ§ (¤ÍÅÑÁ¹ì)
        /// myArray.GetLength(0): ãªéà¾×èÍËÒ¨Ó¹Ç¹á¶Çã¹ÍÒÃìàÃÂì myArray â´Â·Õè 0 ËÁÒÂ¶Ö§ÁÔµÔáÃ¡ (á¶Ç)
        /// </summary>
        /// <param name="matrix">2D array ·Õèà¡çºµÑÇàÅ¢</param>
        /// <param name="column">¤ÍÅÑÁ¹ì·ÕèµéÍ§¡ÒÃËÒ¼ÅÃÇÁ</param>
        void AS14_SumOfNumbersInColumn(int[,] matrix, int column);

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁã¹ C# à¾×èÍáÊ´§ÇÔ¸Õ¤Ô´¢Í§¡ÒÃÊÃéÒ§á¼¹·Õè 3 àËÅÕèÂÁ â´Âãªé nested loop
        /// â´ÂÁÕµÑÇá»Ã´Ñ§¹Õé :
        /// int size = 5;
        /// 
        /// ÅÙ»ÀÒÂ¹Í¡¤Çº¤ØÁ¨Ó¹Ç¹á¶Ç â´ÂàÃÔèÁ·Õèá¶Ç·Õè 1 áÅÐÊÔé¹ÊØ´·Õèá¶Ç·Õè size
        /// for (int i = 1; i <= size; i++)
        /// 
        /// ÅÙ»ÀÒÂã¹¤Çº¤ØÁ¨Ó¹Ç¹´ÒÇã¹áµèÅÐá¶Ç â´Â¨Ó¹Ç¹´ÒÇ¨Ðà¾ÔèÁ¢Öé¹µÒÁËÁÒÂàÅ¢á¶Ç :
        /// for (int j = ???????)
        /// 
        /// ¾ÔÁ¾ìÍÑ¡¢ÃÐ "*" ÍÍ¡ÁÒ á·¹¡ÒÃ Instantiate
        /// Debug.Log("*");
        /// 
        /// ¢Öé¹ºÃÃ·Ñ´ãËÁè á·¹¡ÒÃàÅ×èÍ¹µÓáË¹è§ Y
        /// Console.WriteLine()
        /// 
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì:
        /// 
        /// Size ...
        /// 5
        /// *
        /// **
        /// ***
        /// ****
        /// *****
        /// 
        /// Size ...
        /// 10
        /// *
        /// **
        /// ***
        /// ****
        /// *****
        /// ******
        /// *******
        /// ********
        /// *********
        /// **********
        /// </summary>
        /// <param name="size">¤ÇÒÁÊÙ§¢Í§ÃÙ»ÊÒÁàËÅÕèÂÁ</param>
        void AS15_MakeTheTriangle(int size);

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁÀÒÉÒ C# à¾×èÍáÊ´§µÒÃÒ§ÊÙµÃ¤Ù³ µÑé§áµè 2 ¤Ù³ 1 ¶Ö§ 12 ä»¨¹¶Ö§ 4 ¤Ù³ 1 ¶Ö§ 12 â´Âãªé Nested Loop
        /// ãªé \t à¾×èÍàÇé¹ÇÃÃ¤á·çºÃÐËÇèÒ§ column (áÅÐã¹áµèÅÐºÃÃ·Ñ´¨ÐµéÍ§äÁèÅ§·éÒÂ´éÇÂ \t) àªè¹
        ///
        /// 2 x 1 = 2\t3 x 1 = 3\t4 x 1 = 4   (ÊÑ§à¡µØÇèÒ¨ÐäÁèÁÕ \t µÒÁ·éÒÂ)
        /// 
        /// Debug.Log("\t")
        /// ËÃ×Í line += "\t";
        /// 
        /// µÑÇÍÂèÒ§¼ÅÅÑ¾¸ì:
        /// 
        /// 2 x 1 = 2       3 x 1 = 3       4 x 1 = 4
        /// 2 x 2 = 4       3 x 2 = 6       4 x 2 = 8
        /// 2 x 3 = 6       3 x 3 = 9       4 x 3 = 12
        /// 2 x 4 = 8       3 x 4 = 12      4 x 4 = 16
        /// 2 x 5 = 10      3 x 5 = 15      4 x 5 = 20
        /// 2 x 6 = 12      3 x 6 = 18      4 x 6 = 24
        /// 2 x 7 = 14      3 x 7 = 21      4 x 7 = 28
        /// 2 x 8 = 16      3 x 8 = 24      4 x 8 = 32
        /// 2 x 9 = 18      3 x 9 = 27      4 x 9 = 36
        /// 2 x 10 = 20     3 x 10 = 30     4 x 10 = 40
        /// 2 x 11 = 22     3 x 11 = 33     4 x 11 = 44
        /// 2 x 12 = 24     3 x 12 = 36     4 x 12 = 48
        /// </summary>
        void AS16_MultiplicationTableOf_2_3_and_4();

        #endregion

        #region EXTRA Assignment

        /// <summary>
        /// ¨§à¢ÕÂ¹â»Ãá¡ÃÁ¨ÓÅÍ§à¡Á TicTacToe (XO)
        /// ¡ÓË¹´ãËéÁÕµÑÇá»Ã board : ¢¹Ò´ 3x3 à·èÒ¹Ñé¹
        /// public static char[,] board = new char[3, 3] {
        /// {' ', ' ', ' '},
        /// {' ', ' ', ' '},
        /// {' ', ' ', ' '}
        /// };
        /// 
        /// â´Â AS11_TicTacToeGame_TurnPlay ¨ÐÃÑº 3 µÑÇá»Ã¤×Í
        /// + player: ÃÐºØÇèÒã¹µÒ¹Õéà»ç¹¢Í§¼ÙéàÅè¹½èÒÂäË¹ "X" ËÃ×Í "O" X 
        /// + row, column à»ç¹¡ÒÃÃÐºØµÓáË¹è§·Õè¼ÙéàÅè¹µÒ¹ÕéàÅ×Í¡¨ÐÅ§ã¹ board àªè¹ row=0, column=1
        /// â´Â·Õè method ¹Õé¨ÐµéÍ§¾ÔÁ¾ì µÒÃÒ§ËÅÑ§¨Ò¡ãÊè¤èÒÍÍ¡ÁÒ 
        /// áÅÐáÊ´§ÇèÒ¼ÅÅÑ¾¸ì¡ÒÃàÅè¹µÒ¹Ñé¹à¡Ô´ÍÐäÃ¢Öé¹ «Öè§¨ÐÁÕ¤ÇÒÁà»ç¹ä»ä´é·Ñé§ËÁ´ 5 ÃÙ»áºº¤×Í
        /// -> ">> X Win!" àÁ×èÍ player "X" Å§µÒ¹ÕéáÅéÇ¢¹Ð
        /// -> ">> O Win!" àÁ×èÍ player "O" Å§µÒ¹ÕéáÅéÇ¢¹Ð
        /// -> ">> Draw" àÁ×èÍ¼ÙéàÅè¹ X ËÃ×Í O Å§ä»áÅéÇäÁèÁÕ¼Ùéª¹Ð
        /// -> ">> Continue" àÁ×èÍ¼ÙéàÅè¹ X ËÃ×Í O Å§ä»áÅéÇà¡ÁÂÑ§äÁè¨º - äÁèÁÕ¼Ùéª¹Ð áÅÐÂÑ§àËÅ×ÍªèÍ§ÇèÒ§ãËé¼ÙéàÅè¹ÍÕ¡¤¹Å§µèÍä´é
        /// -> ">> Invalid move" àÁ×èÍ¼ÙéàÅè¹ X ËÃ×Í O àÅ×Í¡Å§ä»ã¹ªèÍ§·ÕèäÁèÇèÒ§ ËÃ×ÍäÁèÁÕÍÂÙè¨ÃÔ§à¢è¹ row=1000 column=1999
        /// 
        /// Input
        /// board:
        /// -------------
        /// |   | X |   |
        /// -------------
        /// |   |   |   |
        /// -------------
        /// |   |   |   |
        /// -------------
        /// player: "X"
        /// row: 0
        /// column: 1
        /// 
        /// Output
        /// -------------
        /// |   | X |   |
        /// -------------
        /// |   |   |   |
        /// -------------
        /// |   |   |   |
        /// -------------
        /// >> Continue
        /// 
        /// Input
        /// board:
        /// -------------
        /// |   | X |   |
        /// -------------
        /// |   |   |   |
        /// -------------
        /// |   |   |   |
        /// -------------
        /// Player: "O"
        /// row: 1
        /// col: 1
        /// 
        /// Output:
        /// -------------
        /// |   | X |   |
        /// -------------
        /// |   | O |   |
        /// -------------
        /// |   |   |   |
        /// -------------
        /// >> Continue
        /// 
        /// NOTE ¡ÒÃ¾ÔÁ¾ìµÒÃÒ§ãËéÃÐÇÑ§àÃ×èÍ§ space ãËé´Õ
        /// 
        /// â´ÂËÒ¡ªèÍ§¹Ñé¹äÁèÇèÒ§ãËé (Invalid input) ãËé¾ÔÁ¾ìÍÍ¡ÁÒÇèÒäÁèÊÒÁÒÃ¶Å§ã¹µÓáË¹è§·ÕèµéÍ§¡ÒÃä´é cannot set X at 0 2 áÅÐÇ¹¡ÅÑºä»ãËéà«µ¤èÒãËÁè
        /// 
        /// Input
        /// board: 
        /// -------------
        /// | X |   | O |
        /// -------------
        /// |   |   |   |
        /// -------------
        /// |   |   |   |
        /// -------------
        /// Player: O
        /// row: 0
        /// column: 2
        /// 
        /// Output
        /// -------------
        /// | X |   | O |
        /// -------------
        /// |   |   |   |
        /// -------------
        /// |   |   |   |
        /// -------------
        /// >> Invalid move
        /// 
        /// ËÅÑ§¨Ò¡¡ÒÃÅ§ã¹áµèÅÐµÒ ÃÐººà¡Á¨ÐµéÍ§ check ÇèÒ ã¤Ãà»ç¹½èÒÂª¹Ð àªè¹
        /// 
        /// Input
        /// board:
        /// -------------
        /// | X | X |   |
        /// -------------
        /// | X | O |   |
        /// -------------
        /// | O |   |   |
        /// -------------
        /// player: O
        /// row: 2
        /// column: 0
        /// 
        /// Output
        /// -------------
        /// | X | X | O |
        /// -------------
        /// | X | O |   |
        /// -------------
        /// | O |   |   |
        /// -------------
        /// >> O wins!
        /// 
        /// Input
        /// board:
        /// -------------
        /// | X |   | O |
        /// -------------
        /// |   |   | O |
        /// -------------
        /// |   |   | X |
        /// -------------
        /// Player: X
        /// row: 2
        /// column: 2
        /// 
        /// Output
        /// -------------
        /// | X |   | O |
        /// -------------
        /// |   | X | O |
        /// -------------
        /// |   |   | X |
        /// -------------
        /// >> X wins!
        /// 
        /// áÅÐ¶éÒÅ§¨¹¤Ãº·Ø¡ªèÍ§áÅéÇäÁèÁÕ¼Ùéª¹Ð ãËé¾ÔÁ¾ìÇèÒ Draw!
        /// 
        /// Input
        /// board:
        /// -------------
        /// | X | X | O |
        /// -------------
        /// | O | O | X |
        /// -------------
        /// | X |   | X |
        /// -------------
        /// Player: O
        /// row: 2
        /// column: 1
        /// 
        /// Output
        /// -------------
        /// | X | X | O |
        /// -------------
        /// | O | O | X |
        /// -------------
        /// | X | O | X |
        /// -------------
        /// >> Draw
        /// 
        /// Input
        /// board:
        /// -------------
        /// | X | X | O |
        /// -------------
        /// | O | O | X |
        /// -------------
        /// | X | O |   |
        /// -------------
        /// Player: X
        /// row: 2
        /// column: 2
        /// 
        /// Output
        /// -------------
        /// | X | X | O |
        /// -------------
        /// | O | O | X |
        /// -------------
        /// | X | O | X |
        /// -------------
        /// >> Draw
        /// 
        /// </summary>
        /// <param name="board">¡ÃÐ´Ò¹ Tic Tac Toe</param>
        /// <param name="playerTurn">µÒ¢Í§¼ÙéàÅè¹ X ËÃ×Í O</param>
        /// <param name="row">á¶Ç·ÕèµéÍ§¡ÒÃàÅè¹</param>
        /// <param name="column">¤ÍÅÑÁ¹ì·ÕèµéÍ§¡ÒÃàÅè¹</param>
        void EX_01_TicTacToeGame_TurnPlay(string[,] board, string playerTurn, int row, int column);

        #endregion
    }
}
